app/controllers/assets_controller.rb

SELECT COUNT(*) FROM `assets` WHERE (name LIKE '%s%' OR idString Like '%s%')
SELECT `assets`.* FROM `assets` WHERE (name LIKE '%as%' OR idString Like '%as%') LIMIT 10 OFFSET 0
---
  def index
    #@assets = Asset.all(:order => 'name')
    @assets = Asset.search(params[:search]).paginate(:per_page => 10, :page => params[:page])

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 1 LIMIT 1
---
  def show
    @asset = Asset.find(params[:id])

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 2 LIMIT 1
---
  def edit
    @asset = Asset.find(params[:id])

INSERT INTO `assets` (`name`, `updated_at`, `idString`, `created_at`) VALUES ('Small Scissors', '2012-08-06 21:18:21', '21Scissors', '2012-08-06 21:18:21')
---
  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 2 LIMIT 1
UPDATE `assets` SET `updated_at` = '2012-08-07 21:30:55', `name` = 'aa', `idString` = 'asdvvv' WHERE `assets`.`id` = 6
---
  def update
    @asset = Asset.find(params[:id])

    respond_to do |format|
      if @asset.update_attributes(params[:asset])