app/controllers/chk_out_ins_controller.rb

  def index
    #@chk_out_ins = ChkOutIn.all(:order => 'ISNULL(checkedInTime) desc, checkedInTime desc, checkedOutTime')
    @chk_out_ins = ChkOutIn.includes(:employee, :asset).search(params[:search]).order('ISNULL(checkedInTime) desc, checkedInTime desc, checkedOutTime').paginate(:per_page => 10, :page => params[:page])
---
SELECT COUNT(DISTINCT `chk_out_ins`.`id`) FROM `chk_out_ins` LEFT OUTER JOIN `employees` ON `employees`.`id` = `chk_out_ins`.`employee_id` LEFT OUTER JOIN `assets` ON `assets`.`id` = `chk_out_ins`.`asset_id` WHERE (employees.name LIKE '%b%' OR assets.name Like '%b%')
SELECT `assets`.* FROM `assets` WHERE (`assets`.`id` IN (1,2,3))
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE (chk_out_ins.employee.name LIKE '%s%' OR chk_out_ins.asset.name Like '%s%') ORDER BY ISNULL(checkedInTime) desc, checkedInTime desc, checkedOutTime LIMIT 10 OFFSET 0

  def show
    @chk_out_in = ChkOutIn.find(params[:id])
---
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE `chk_out_ins`.`id` = 1 LIMIT 1

  def edit
    @chk_out_in = ChkOutIn.find(params[:id])
---
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE `chk_out_ins`.`id` = 1 LIMIT 1

  def create
    @chk_out_in = ChkOutIn.new(params[:chk_out_in])

    respond_to do |format|
      if @chk_out_in.save
---
INSERT INTO `chk_out_ins` (`checkedOutTime`, `asset_id`, `created_at`, `employee_id`, `updated_at`, `checkedInTime`) VALUES (NULL, 2, '2012-08-06 22:02:16', 1, '2012-08-06 22:02:16', NULL)

  def checked_out_assets
    employee_id = Employee.find_by_idString(params[:employee_id]).id

    if !employee_id.nil?
      @chk_out_in = ChkOutIn.find(:all, :conditions => ["employee_id = ? && checkedInTime IS NULL",employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`idString` = '21Ben' LIMIT 1
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE (employee_id = '21Ben' && checkedInTime IS NULL)

  def check_out_asset_return_details
    asset_id = Asset.find_by_idString(params[:asset_id]).id
    employee_id = Employee.find_by_idString(params[:employee_id]).id
    already_checked_out = ChkOutIn.find(:first, :conditions => ['asset_id = ? && checkedInTime IS NULL', asset_id])

    if !asset_id.nil? && !employee_id.nil? && already_checked_out.nil?
      @chk_out_in = ChkOutIn.new(:asset_id => asset_id, :employee_id => employee_id, :checkedOutTime => Time.now)
      @chk_out_in.save
---
SELECT `assets`.* FROM `assets` WHERE `assets`.`idString` = '21LawnMower' LIMIT 1
SELECT `employees`.* FROM `employees` WHERE `employees`.`idString` = '21Ben' LIMIT 1
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE (asset_id = 1 && checkedInTime IS NULL) LIMIT 1
INSERT INTO `chk_out_ins` (`updated_at`, `created_at`, `asset_id`, `checkedInTime`, `employee_id`, `checkedOutTime`) VALUES ('2012-08-07 05:32:19', '2012-08-07 05:32:19', 2, NULL, 1, '2012-08-07 05:32:19')

  def get_asset
    asset_id = Asset.find_by_idString(params[:asset_id]).id

    if !asset_id.nil?
      @asset_in = ChkOutIn.find(:first, :conditions => ["asset_id = ? && checkedInTime IS NULL",asset_id])
---
SELECT `assets`.* FROM `assets` WHERE `assets`.`idString` = '21Scissors' LIMIT 1
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE (asset_id = 2 && checkedInTime IS NULL) LIMIT 1

  def checkin_asset
    asset_id = Asset.find_by_idString(params[:asset_id]).id

    if !asset_id.nil?
      @asset_in = ChkOutIn.find(:first, :conditions => ["asset_id = ? && checkedInTime IS NULL",asset_id])

      @asset_in.update_attributes(:checkedInTime => Time.now)
---
SELECT `assets`.* FROM `assets` WHERE `assets`.`idString` = '21Scissors' LIMIT 1
SELECT `chk_out_ins`.* FROM `chk_out_ins` WHERE (asset_id = 2 && checkedInTime IS NULL) LIMIT 1
UPDATE `chk_out_ins` SET `updated_at` = '2012-08-07 09:05:46', `checkedInTime` = '2012-08-07 09:05:46' WHERE `chk_out_ins`.`id` = 29