app/controllers/employees_controller.rb

  def index
    #@employees = Employee.all(:order => 'name')
    @employees = Employee.search(params[:search]).paginate(:per_page => 10, :page => params[:page])
---
SELECT COUNT(*) FROM `employees` WHERE (name LIKE '%%' OR idString Like '%%')
SELECT `employees`.* FROM `employees` WHERE (name LIKE '%%' OR idString Like '%%') LIMIT 2 OFFSET 0

  def show
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def edit
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save
---
INSERT INTO `employees` (`name`, `idString`, `updated_at`, `admin`, `created_at`) VALUES ('Trevor Olsen', '21Trevor', '2012-08-06 21:17:37', 0, '2012-08-06 21:17:37')

  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
      if @employee.update_attributes(params[:employee])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 4 LIMIT 1
UPDATE `employees` SET `name` = 'as', `updated_at` = '2012-08-07 21:24:54' WHERE `employees`.`id` = 4